[
  {
    "name": "Press de Banca",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Un ejercicio de pecho donde presionas una barra hacia arriba mientras estás acostado en un banco."
  },
  {
    "name": "Press de Banca Inclinado",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Una variación del press de banca realizado en un banco inclinado para apuntar a la parte superior del pecho."
  },
  {
    "name": "Press de Banca Declinado",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Una variación del press de banca realizado en un banco declinado para apuntar a la parte inferior del pecho."
  },
  {
    "name": "Press de Hombros",
    "muscleGroup": "shoulders",
    "type": "compound",
    "description": "Un ejercicio de hombros donde presionas un peso sobre la cabeza mientras estás de pie o sentado."
  },
  {
    "name": "Peso Muerto",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Un ejercicio de cuerpo completo que consiste en levantar una barra desde el suelo hasta la posición de pie."
  },
  {
    "name": "Pec Deck",
    "muscleGroup": "chest",
    "type": "machine",
    "description": "Un ejercicio en máquina que aísla los músculos del pecho al imitar el movimiento de un fly."
  },
  {
    "name": "Extensión de Piernas",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Un ejercicio en máquina que apunta a los cuádriceps al extender las piernas desde una posición sentada."
  },
  {
    "name": "Sentadilla",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Un ejercicio de la parte inferior del cuerpo donde doblas las rodillas y las caderas para bajar el cuerpo y luego te levantas."
  },
  {
    "name": "Sentadilla con Barra",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Un ejercicio de la parte inferior del cuerpo donde doblas las rodillas y las caderas para bajar el cuerpo con una barra colocada en la parte superior de la espalda, y luego te levantas."
  },
  {
    "name": "Prensa de Piernas",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Un ejercicio en máquina donde empujas un peso lejos de ti usando las piernas."
  },
  {
    "name": "Jalón al Pecho",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Un ejercicio en máquina que apunta a la parte superior de la espalda al tirar de una barra hacia el pecho."
  },
  {
    "name": "Dominadas",
    "muscleGroup": "back",
    "type": "bodyweight",
    "description": "Un ejercicio de la parte superior del cuerpo donde levantas tu cuerpo hasta una barra usando los músculos de la espalda y los brazos."
  },
  {
    "name": "Remo Sentado",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Un ejercicio en máquina que apunta a los músculos de la espalda al tirar de un mango hacia tu torso mientras estás sentado."
  },
  {
    "name": "Curl de Bíceps",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Un ejercicio para los brazos que apunta a los bíceps al levantar un peso hacia tu hombro."
  },
  {
    "name": "Extensión de Tríceps por Encima de la Cabeza",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Un ejercicio para los brazos que apunta a los tríceps al extender el brazo en el codo."
  },
  {
    "name": "Curl de Piernas",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Un ejercicio en máquina que apunta a los isquiotibiales al doblar las piernas hacia los glúteos."
  },
  {
    "name": "Elevación Lateral",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Un ejercicio para los hombros donde levantas pesos hacia los lados de tu cuerpo."
  },
  {
    "name": "Elevación Frontal",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Un ejercicio para los hombros donde levantas pesos hacia la parte frontal de tu cuerpo."
  },
  {
    "name": "Elevación de Gemelos",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Un ejercicio de la parte inferior del cuerpo que apunta a los músculos de los gemelos al levantar los talones del suelo."
  },
  {
    "name": "Curl de Martillo",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Un ejercicio para los brazos similar al curl de bíceps, pero con un agarre neutro."
  },
  {
    "name": "Curl Predicador",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Una variación del curl de bíceps realizada en un banco predicador para aislar los bíceps."
  },
  {
    "name": "Extensión de Tríceps en Polea",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Un ejercicio para los brazos que apunta a los tríceps al empujar un accesorio de polea hacia abajo."
  },
  {
    "name": "Press de Pecho en Máquina",
    "muscleGroup": "chest",
    "type": "machine",
    "description": "Un ejercicio en máquina que imita el press de banca."
  },
  {
    "name": "Sentadilla en Máquina Smith",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Una variación de la sentadilla realizada en una máquina Smith para mayor estabilidad."
  },
  {
    "name": "Remo con Barra T",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Un ejercicio para la espalda donde tiras de una barra en forma de T hacia tu torso."
  },
  {
    "name": "Remo Inclinado",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Un ejercicio para la espalda donde te inclinas hacia adelante y tiras de un peso hacia tu torso."
  },
  {
    "name": "Remo Vertical",
    "muscleGroup": "shoulders",
    "type": "compound",
    "description": "Un ejercicio para los hombros donde tiras de un peso hacia arriba a lo largo de la parte frontal de tu cuerpo."
  },
  {
    "name": "Aperturas con Mancuernas",
    "muscleGroup": "chest",
    "type": "isolation",
    "description": "Un ejercicio para el pecho donde bajas y levantas mancuernas hacia los lados mientras estás acostado en un banco."
  },
  {
    "name": "Press de Banca Inclinado con Mancuernas",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Un ejercicio para el pecho similar al press de banca inclinado pero usando mancuernas."
  },
  {
    "name": "Press de Hombros en Máquina",
    "muscleGroup": "shoulders",
    "type": "machine",
    "description": "Un ejercicio para los hombros realizado en una máquina que imita el press por encima de la cabeza."
  },
  {
    "name": "Aperturas Invertidas en Máquina",
    "muscleGroup": "shoulders",
    "type": "machine",
    "description": "Un ejercicio en máquina que apunta a los deltoides posteriores al imitar el movimiento del fly inverso."
  },
  {
    "name": "Crossover en Polea",
    "muscleGroup": "chest",
    "type": "isolation",
    "description": "Un ejercicio para el pecho que apunta a la parte interna del pecho al tirar de cables a través del cuerpo."
  },
  {
    "name": "Elevación de Gemelos Sentado",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Un ejercicio para los gemelos realizado mientras estás sentado, apuntando al músculo sóleo."
  },
  {
    "name": "Elevación de Gemelos de Pie",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Un ejercicio para los gemelos realizado mientras estás de pie, apuntando al músculo gastrocnemio."
  },
  {
    "name": "Peso Muerto Rumano",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Una variación del peso muerto que apunta a los isquiotibiales y los glúteos."
  },
  {
    "name": "Puente de Glúteos",
    "muscleGroup": "glutes",
    "type": "bodyweight",
    "description": "Un ejercicio para la parte inferior del cuerpo que apunta a los glúteos al levantar las caderas del suelo mientras estás acostado de espaldas."
  },
  {
    "name": "Elevación de Cadera",
    "muscleGroup": "glutes",
    "type": "compound",
    "description": "Un ejercicio para la parte inferior del cuerpo que apunta a los glúteos al levantar las caderas del suelo con los hombros apoyados en un banco."
  },
  {
    "name": "Curl de Bíceps en Polea",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Un ejercicio para los brazos que apunta a los bíceps al flexionar un accesorio de polea."
  },
  {
    "name": "Press de Hombros con Mancuernas",
    "muscleGroup": "shoulders",
    "type": "compound",
    "description": "Un ejercicio para los hombros donde empujas mancuernas sobre la cabeza."
  },
  {
    "name": "Press de Banca en Máquina Smith",
    "muscleGroup": "chest",
    "type": "machine",
    "description": "Una variación del press de banca realizada en una máquina Smith para mayor estabilidad."
  },
  {
    "name": "Sentadilla Hack",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Una variación de la sentadilla realizada en una máquina de sentadilla hack para apuntar a los cuádriceps."
  },
  {
    "name": "Zancada Inversa",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Un ejercicio de la parte inferior del cuerpo donde das un paso hacia atrás en una zancada."
  },
  {
    "name": "Step-Up",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Un ejercicio de la parte inferior del cuerpo donde subes a una plataforma elevada."
  },
  {
    "name": "Balanceo con Kettlebell",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Un ejercicio de cuerpo completo que consiste en balancear una kettlebell entre las piernas y hasta la altura de los hombros."
  },
  {
    "name": "Sentadilla Goblet",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Una variación de la sentadilla realizada mientras sostienes un peso frente al pecho."
  },
  {
    "name": "Peso Muerto Sumo",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Una variación del peso muerto con una postura amplia que apunta a la parte interna de los muslos y los glúteos."
  },
  {
    "name": "Máquina de Abducción de Cadera",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Un ejercicio en máquina que apunta a la parte externa de los muslos al abrir las piernas."
  },
  {
    "name": "Máquina de Aducción de Cadera",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Un ejercicio en máquina que apunta a la parte interna de los muslos al cerrar las piernas."
  },
  {
    "name": "Face Pull",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Un ejercicio para los hombros que apunta a los deltoides posteriores al tirar de un accesorio de polea hacia el rostro."
  },
  {
    "name": "Aperturas con Mancuernas en Banco Inclinado",
    "muscleGroup": "chest",
    "type": "isolation",
    "description": "Un ejercicio para el pecho realizado en un banco inclinado que apunta a la parte superior del pecho."
  },
  {
    "name": "Fondos",
    "muscleGroup": "arms",
    "type": "bodyweight",
    "description": "Un ejercicio para el pecho y los tríceps donde bajas y levantas tu cuerpo usando barras paralelas."
  },
  {
    "name": "Flexiones",
    "muscleGroup": "chest",
    "type": "bodyweight",
    "description": "Un ejercicio para el pecho, los hombros y los tríceps donde empujas tu cuerpo hacia arriba desde el suelo."
  },
  {
    "name": "Plancha",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Un ejercicio para el core donde mantienes la posición de flexión por un tiempo determinado."
  },
  {
    "name": "Giro Ruso",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Un ejercicio oblicuo donde giras el torso de un lado a otro mientras sostienes un peso."
  },
  {
    "name": "Elevación de Piernas Colgado",
    "muscleGroup": "abdomen",
    "type": "bodyweight",
    "description": "Un ejercicio abdominal donde levantas las piernas mientras estás colgado de una barra."
  },
  {
    "name": "Escaladores",
    "muscleGroup": "full_body",
    "type": "bodyweight",
    "description": "Un ejercicio de cuerpo completo donde realizas un movimiento de correr mientras estás en posición de plancha."
  },
  {
    "name": "Burpees",
    "muscleGroup": "full_body",
    "type": "bodyweight",
    "description": "Un ejercicio de cuerpo completo que incluye una sentadilla, un salto y una flexión."
  },
  {
    "name": "Salto al Cajón",
    "muscleGroup": "legs",
    "type": "plyometric",
    "description": "Un ejercicio pliométrico de la parte inferior del cuerpo donde saltas a una plataforma elevada."
  },
  {
    "name": "Turkish Get-Up",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Un ejercicio de cuerpo completo que consiste en pasar de estar acostado a estar de pie mientras sostienes un peso sobre la cabeza."
  },
  {
    "name": "Caminata del Granjero",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Un ejercicio donde caminas mientras sostienes pesas pesadas en cada mano."
  },
  {
    "name": "Arrancada",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Un levantamiento olímpico donde levantas una barra del suelo hasta sobre la cabeza en un solo movimiento."
  },
  {
    "name": "Clean and Jerk",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Un levantamiento olímpico donde levantas una barra del suelo hasta los hombros y luego sobre la cabeza."
  },
  {
    "name": "Cuerdas de Batalla",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Un ejercicio donde creas ondas con cuerdas pesadas para desarrollar fuerza y resistencia."
  },
  {
    "name": "Crunch en Máquina",
    "muscleGroup": "abdomen",
    "type": "machine",
    "description": "Un ejercicio en máquina que apunta a los músculos abdominales al imitar el movimiento de un crunch."
  },
  {
    "name": "Remo en Máquina con Apoyo en el Pecho",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Un ejercicio para la espalda realizado en una máquina donde remas con el pecho apoyado en un soporte, apuntando a los músculos de la espalda superior y media."
  },
  {
    "name": "Remo con Barra",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Un ejercicio para la espalda donde tiras de una barra hacia tu torso mientras estás inclinado hacia adelante."
  },
  {
    "name": "Tríceps Francés",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Un ejercicio para los tríceps donde bajas una barra hacia tu frente y luego extiendes nuevamente."
  },
  {
    "name": "Sentadilla Búlgara",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Un ejercicio de la parte inferior del cuerpo donde realizas una sentadilla con el pie trasero elevado en un banco."
  },
  {
    "name": "Pallof Press",
    "muscleGroup": "core",
    "type": "isolation",
    "description": "Un ejercicio para el core que consiste en empujar un cable o banda de resistencia lejos del cuerpo para resistir la rotación."
  },
  {
    "name": "Elevación de Rodillas Colgado",
    "muscleGroup": "abdomen",
    "type": "bodyweight",
    "description": "Un ejercicio abdominal donde levantas las rodillas hacia el pecho mientras estás colgado de una barra."
  },
  {
    "name": "Press de Hombros en Landmine",
    "muscleGroup": "shoulders",
    "type": "compound",
    "description": "Un ejercicio para los hombros donde empujas una barra anclada en un extremo en un accesorio de landmine."
  },
  {
    "name": "Remo en Landmine",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Un ejercicio para la espalda donde tiras de una barra anclada en un extremo en un accesorio de landmine hacia tu torso."
  },
  {
    "name": "Elevación de Gemelos con Peso",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Un ejercicio para los gemelos donde levantas los talones mientras estás inclinado hacia adelante con peso en la parte inferior de la espalda."
  },
  {
    "name": "Saltar a la Cuerda",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Un ejercicio cardiovascular que consiste en saltar una cuerda mientras pasa bajo tus pies y sobre tu cabeza."
  },
  {
    "name": "Correr",
    "muscleGroup": "legs",
    "type": "cardio",
    "description": "Un ejercicio cardiovascular que consiste en trotar o correr una distancia."
  },
  {
    "name": "Ciclismo",
    "muscleGroup": "legs",
    "type": "cardio",
    "description": "Un ejercicio cardiovascular que consiste en andar en bicicleta, ya sea estacionaria o en movimiento."
  },
  {
    "name": "Máquina de Remo",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Un ejercicio cardiovascular que imita la acción de remar un bote, usando una máquina."
  },
  {
    "name": "Elíptica",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Un ejercicio cardiovascular realizado en una máquina que imita caminar o correr sin causar presión excesiva en las articulaciones."
  },
  {
    "name": "Entrenamiento Interválico de Alta Intensidad (HIIT)",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Una forma de ejercicio cardiovascular que alterna cortos períodos de ejercicio anaeróbico intenso con períodos de recuperación menos intensos."
  },
  {
    "name": "Escaladora",
    "muscleGroup": "legs",
    "type": "cardio",
    "description": "Un ejercicio cardiovascular realizado en una máquina que imita el movimiento de subir escaleras."
  },
  {
    "name": "Aeróbicos",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Una forma de ejercicio cardiovascular que incluye actividades rítmicas, a menudo realizadas con música."
  },
  {
    "name": "Cardio de Baile",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Un ejercicio cardiovascular que incluye varios movimientos y rutinas de baile para elevar la frecuencia cardíaca."
  },
  {
    "name": "Sombra de Boxeo",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Un ejercicio cardiovascular que consiste en lanzar golpes al aire para aumentar la frecuencia cardíaca y mejorar el acondicionamiento cardiovascular."
  },
  {
    "name": "Jalón al Pecho con Agarre Estrecho",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Una variación del jalón al pecho donde se usa un agarre estrecho para trabajar los músculos internos de la espalda."
  },
  {
    "name": "Jalón al Pecho con Agarre Supinado",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Una variación del jalón al pecho donde se usa un agarre supinado para trabajar los bíceps y la parte superior de la espalda."
  },
  {
    "name": "Jalón de Cable",
    "muscleGroup": "back",
    "type": "isolation",
    "description": "Un ejercicio para la espalda en el que tiras de una barra de cable desde arriba de la cabeza hacia las caderas, enfocándote en los dorsales."
  },
  {
    "name": "Pullover con Mancuerna",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Un ejercicio versátil que trabaja el pecho y los dorsales al bajar y levantar una mancuerna sobre la cabeza mientras estás acostado en un banco."
  },
  {
    "name": "Press de Banca con Agarre Invertido",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Una variación del press de banca en la que usas un agarre invertido para enfatizar la parte superior del pecho y los tríceps."
  },
  {
    "name": "Press de Pecho con Cable",
    "muscleGroup": "chest",
    "type": "isolation",
    "description": "Un ejercicio de pecho en el que empujas un accesorio de cable hacia adelante, similar al press de banca, pero con tensión constante."
  },
  {
    "name": "Elevación Frontal con Cable",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Un ejercicio de hombros en el que levantas un accesorio de cable hacia el frente, enfocándote en los deltoides anteriores."
  },
  {
    "name": "Elevación Lateral con Cable",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Un ejercicio de hombros en el que levantas un accesorio de cable hacia el lado, enfocándote en los deltoides laterales."
  },
  {
    "name": "Remo con Mancuerna a un Brazo",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Un ejercicio para la espalda en el que remas una mancuerna hacia tu torso mientras estás inclinado, enfocándote en cada lado individualmente."
  },
  {
    "name": "Encogimiento de Hombros con Mancuernas",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Un ejercicio de hombros que trabaja el trapecio al encoger los hombros mientras sostienes mancuernas."
  },
  {
    "name": "Curl de Piernas Acostado",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Un ejercicio en máquina que trabaja los isquiotibiales al doblar las piernas hacia los glúteos mientras estás acostado boca abajo."
  },
  {
    "name": "Buenos Días",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Un ejercicio para la parte inferior del cuerpo en el que flexionas la cadera para bajar el torso, trabajando los isquiotibiales y glúteos."
  },
  {
    "name": "Sentadilla Zercher",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Una variación de la sentadilla donde sostienes la barra en la curva de los codos, enfatizando los cuádriceps y el core."
  },
  {
    "name": "Sentadilla Sissy",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Una variación de la sentadilla centrada en los cuádriceps, realizada con un banco sissy o inclinándote hacia atrás en la punta de los pies."
  },
  {
    "name": "Peso Muerto Jefferson",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Una variación del peso muerto donde te colocas alrededor de la barra, enfocándote en los cuádriceps, glúteos y core."
  },
  {
    "name": "Sentadilla Cossack",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Un ejercicio para la parte inferior del cuerpo en el que realizas una lunge lateral profunda, enfocándote en los músculos internos de los muslos y glúteos."
  },
  {
    "name": "Dragon Flag",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Un ejercicio avanzado de core donde bajas y levantas el cuerpo en línea recta mientras estás acostado en un banco."
  },
  {
    "name": "Posición de Cuerpo Hueco",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Un ejercicio de core donde mantienes una posición hueca, con la parte baja de la espalda presionada contra el suelo y los brazos y piernas extendidos."
  },
  {
    "name": "Crunch Inverso",
    "muscleGroup": "abdomen",
    "type": "bodyweight",
    "description": "Un ejercicio abdominal en el que flexionas las caderas hacia el pecho, enfocándote en los abdominales inferiores."
  },
  {
    "name": "Rueda Abdominal",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Un ejercicio de core que implica rodar una rueda abdominal lejos del cuerpo mientras mantienes el core estable."
  },
  {
    "name": "Flexiones Pike",
    "muscleGroup": "shoulders",
    "type": "bodyweight",
    "description": "Un ejercicio de hombros en el que realizas una flexión en posición pike, enfatizando los hombros."
  },
  {
    "name": "Crunch en Cable",
    "muscleGroup": "abdomen",
    "type": "bodyweight",
    "description": "Un ejercicio abdominal en el que realizas un movimiento de crunch con una polea para añadir resistencia."
  }
]
