[
  {
    "name": "Bankdrukken",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Een borst oefening waarbij je een halter omhoog drukt terwijl je op een bank ligt."
  },
  {
    "name": "Incline Bankdrukken",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Een variatie van het bankdrukken uitgevoerd op een schuine bank om de bovenkant van de borst te richten."
  },
  {
    "name": "Decline Bankdrukken",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Een variatie van het bankdrukken uitgevoerd op een schuine bank om de onderkant van de borst te richten."
  },
  {
    "name": "Schouderdruk",
    "muscleGroup": "shoulders",
    "type": "compound",
    "description": "Een schouderoefening waarbij je een gewicht boven je hoofd drukt terwijl je staat of zit."
  },
  {
    "name": "Deadlift",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Een oefening voor het hele lichaam waarbij je een halter van de grond naar een staande positie tilt."
  },
  {
    "name": "Pec Deck Machine",
    "muscleGroup": "chest",
    "type": "machine",
    "description": "Een machine oefening die de borstspieren isoleert door de beweging van een fly na te bootsen."
  },
  {
    "name": "Leg Extension Machine",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Een machine oefening die de quadriceps richt door de benen vanuit een zittende positie te strekken."
  },
  {
    "name": "Squat",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een oefening voor de onderlichaam waarbij je je knieën en heupen buigt om je lichaam te laten zakken en vervolgens weer op te staan."
  },
  {
    "name": "Barbell Back Squat",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een oefening voor de onderlichaam waarbij je je knieën en heupen buigt om je lichaam te laten zakken, met een halter op je bovenrug, en vervolgens weer op te staan."
  },
  {
    "name": "Leg Press Machine",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Een machine oefening waarbij je een gewicht van je af duwt met je benen."
  },
  {
    "name": "Lat Pulldown",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Een machine oefening die de bovenrug richt door een stang naar je borst te trekken."
  },
  {
    "name": "Pull-Up",
    "muscleGroup": "back",
    "type": "bodyweight",
    "description": "Een oefening voor de bovenlichaam waarbij je je lichaam optrekt naar een stang met behulp van je rug- en armspieren."
  },
  {
    "name": "Seated Row",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Een machine oefening die de rugspieren richt door een hendel naar je torso te trekken terwijl je zit."
  },
  {
    "name": "Bicep Curl",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Een armoefening die de biceps richt door een gewicht naar je schouder te tillen."
  },
  {
    "name": "Tricep Overhead Extension",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Een armoefening die de triceps richt door de arm bij de elleboog te strekken."
  },
  {
    "name": "Leg Curl Machine",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Een machine oefening die de hamstrings richt door de benen naar de billen te buigen."
  },
  {
    "name": "Lateral Raise",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Een schouderoefening waarbij je gewichten naar de zijkant van je lichaam tilt."
  },
  {
    "name": "Front Raise",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Een schouderoefening waarbij je gewichten naar de voorkant van je lichaam tilt."
  },
  {
    "name": "Calf Raise",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Een oefening voor de onderlichaam die de kuitspieren richt door de hielen van de grond te tillen."
  },
  {
    "name": "Hammer Curl",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Een armoefening vergelijkbaar met de bicep curl, maar met een neutrale greep."
  },
  {
    "name": "Preacher Curl",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Een variatie van de bicep curl uitgevoerd op een preacher bank om de biceps te isoleren."
  },
  {
    "name": "Cable Tricep Pushdown",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Een armoefening die de triceps richt door een kabelattachment naar beneden te duwen."
  },
  {
    "name": "Chest Press Machine",
    "muscleGroup": "chest",
    "type": "machine",
    "description": "Een machine oefening die het bankdrukken nabootst."
  },
  {
    "name": "Smith Machine Squat",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Een variatie van de squat uitgevoerd op een Smith machine voor extra stabiliteit."
  },
  {
    "name": "T-Bar Row",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Een rugoefening waarbij je een T-bar naar je torso trekt."
  },
  {
    "name": "Bent Over Row",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Een rugoefening waarbij je voorover buigt en een gewicht naar je torso trekt."
  },
  {
    "name": "Upright Row",
    "muscleGroup": "shoulders",
    "type": "compound",
    "description": "Een schouderoefening waarbij je een gewicht omhoog trekt langs de voorkant van je lichaam."
  },
  {
    "name": "Dumbbell Fly",
    "muscleGroup": "chest",
    "type": "isolation",
    "description": "Een borst oefening waarbij je halters naar de zijkanten van je lichaam laat zakken en weer optilt terwijl je op een bank ligt."
  },
  {
    "name": "Incline Dumbbell Press",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Een borst oefening vergelijkbaar met de incline bankdrukken maar met halters."
  },
  {
    "name": "Machine Shoulder Press",
    "muscleGroup": "shoulders",
    "type": "machine",
    "description": "Een schouderoefening uitgevoerd op een machine die het drukken boven het hoofd nabootst."
  },
  {
    "name": "Reverse Pec Deck Fly",
    "muscleGroup": "shoulders",
    "type": "machine",
    "description": "Een machine oefening die de achterste schouderspieren richt door de beweging van een reverse fly na te bootsen."
  },
  {
    "name": "Cable Crossover",
    "muscleGroup": "chest",
    "type": "isolation",
    "description": "Een borst oefening die de binnenkant van de borst richt door kabels over het lichaam te trekken."
  },
  {
    "name": "Seated Calf Raise",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Een kuit oefening uitgevoerd terwijl je zit, gericht op de soleus spier."
  },
  {
    "name": "Standing Calf Raise",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Een kuit oefening uitgevoerd terwijl je staat, gericht op de gastrocnemius spier."
  },
  {
    "name": "Romanian Deadlift",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een variatie van de deadlift die de hamstrings en bilspieren richt."
  },
  {
    "name": "Glute Bridge",
    "muscleGroup": "glutes",
    "type": "bodyweight",
    "description": "Een oefening voor de onderlichaam die de bilspieren richt door de heupen van de grond te tillen terwijl je op je rug ligt."
  },
  {
    "name": "Hip Thrust",
    "muscleGroup": "glutes",
    "type": "compound",
    "description": "Een oefening voor de onderlichaam die de bilspieren richt door de heupen van de grond te tillen met de schouders ondersteund op een bank."
  },
  {
    "name": "Cable Bicep Curl",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Een armoefening die de biceps richt door een kabelattachment te buigen."
  },
  {
    "name": "Dumbbell Shoulder Press",
    "muscleGroup": "shoulders",
    "type": "compound",
    "description": "Een schouderoefening waarbij je halters boven je hoofd drukt."
  },
  {
    "name": "Smith Machine Bench Press",
    "muscleGroup": "chest",
    "type": "machine",
    "description": "Een variatie van het bankdrukken uitgevoerd op een Smith machine voor extra stabiliteit."
  },
  {
    "name": "Hack Squat",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Een variatie van de squat uitgevoerd op een hack squat machine om de quadriceps te richten."
  },
  {
    "name": "Reverse Lunge",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een oefening voor de onderlichaam waarbij je naar achteren stapt in een lunge."
  },
  {
    "name": "Step-Up",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een oefening voor de onderlichaam waarbij je op een verhoogd platform stapt."
  },
  {
    "name": "Kettlebell Swing",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Een oefening voor het hele lichaam waarbij je een kettlebell tussen de benen en tot schouderhoogte zwaait."
  },
  {
    "name": "Goblet Squat",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een variatie van de squat uitgevoerd terwijl je een gewicht voor de borst houdt."
  },
  {
    "name": "Sumo Deadlift",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een variatie van de deadlift met een brede stand die de binnenkant van de dijen en de bilspieren richt."
  },
  {
    "name": "Hip Abduction Machine",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Een machine oefening die de buitenkant van de dijen richt door de benen uit elkaar te bewegen."
  },
  {
    "name": "Hip Adduction Machine",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Een machine oefening die de binnenkant van de dijen richt door de benen naar elkaar toe te bewegen."
  },
  {
    "name": "Cable Face Pull",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Een schouderoefening die de achterste schouderspieren richt door een kabelattachment naar het gezicht te trekken."
  },
  {
    "name": "Incline Dumbbell Fly",
    "muscleGroup": "chest",
    "type": "isolation",
    "description": "Een borst oefening uitgevoerd op een schuine bank die de bovenkant van de borst richt."
  },
  {
    "name": "Dips",
    "muscleGroup": "arms",
    "type": "bodyweight",
    "description": "Een oefening voor de borst en triceps waarbij je je lichaam laat zakken en optilt met behulp van parallelle stangen."
  },
  {
    "name": "Push-Up",
    "muscleGroup": "chest",
    "type": "bodyweight",
    "description": "Een oefening voor de borst, schouders en triceps waarbij je je lichaam van de grond omhoog duwt."
  },
  {
    "name": "Plank",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Een oefening voor de core waarbij je een opdrukpositie vasthoudt voor een bepaalde tijd."
  },
  {
    "name": "Russian Twist",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Een schuine oefening waarbij je je torso van de ene naar de andere kant draait terwijl je een gewicht vasthoudt."
  },
  {
    "name": "Hanging Leg Raise",
    "muscleGroup": "abdomen",
    "type": "bodyweight",
    "description": "Een buikspieroefening waarbij je je benen optilt terwijl je aan een stang hangt."
  },
  {
    "name": "Mountain Climbers",
    "muscleGroup": "full_body",
    "type": "bodyweight",
    "description": "Een oefening voor het hele lichaam waarbij je een rennende beweging maakt terwijl je in plankpositie staat."
  },
  {
    "name": "Burpees",
    "muscleGroup": "full_body",
    "type": "bodyweight",
    "description": "Een oefening voor het hele lichaam die een squat, sprong en push-up omvat."
  },
  {
    "name": "Box Jump",
    "muscleGroup": "legs",
    "type": "plyometric",
    "description": "Een plyometrische oefening voor de onderlichaam waarbij je op een verhoogd platform springt."
  },
  {
    "name": "Turkish Get-Up",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Een oefening voor het hele lichaam waarbij je van liggende naar staande positie gaat terwijl je een gewicht boven je hoofd houdt."
  },
  {
    "name": "Farmer's Walk",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Een oefening waarbij je loopt terwijl je zware gewichten in elke hand houdt."
  },
  {
    "name": "Snatch",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Een olympische lift waarbij je een halter van de grond naar boven tilt in één beweging."
  },
  {
    "name": "Clean and Jerk",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Een olympische lift waarbij je een halter van de grond naar de schouders en vervolgens boven je hoofd tilt."
  },
  {
    "name": "Battle Ropes",
    "muscleGroup": "full_body",
    "type": "compound",
    "description": "Een oefening waarbij je golven creëert met zware touwen om kracht en uithoudingsvermogen op te bouwen."
  },
  {
    "name": "Crunch Machine",
    "muscleGroup": "abdomen",
    "type": "machine",
    "description": "Een machine oefening die de buikspieren richt door de beweging van een crunch na te bootsen."
  },
  {
    "name": "Chest Supported Row Machine",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Een rugoefening uitgevoerd op een machine waarbij je roeit met je borst ondersteund op een pad, gericht op de boven- en middenrugspieren."
  },
  {
    "name": "Barbell Row",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Een rugoefening waarbij je een halter naar je torso trekt terwijl je voorover buigt."
  },
  {
    "name": "Skull Crusher",
    "muscleGroup": "arms",
    "type": "isolation",
    "description": "Een tricep oefening waarbij je een halter naar je voorhoofd laat zakken en weer omhoog strekt."
  },
  {
    "name": "Bulgarian Split Squat",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een oefening voor de onderlichaam waarbij je een split squat uitvoert met je achterste voet verhoogd op een bank."
  },
  {
    "name": "Pallof Press",
    "muscleGroup": "core",
    "type": "isolation",
    "description": "Een core oefening waarbij je een kabel of weerstandsband van het lichaam weg duwt om rotatie te weerstaan."
  },
  {
    "name": "Hanging Knee Raise",
    "muscleGroup": "abdomen",
    "type": "bodyweight",
    "description": "Een buikspieroefening waarbij je je knieën naar je borst optilt terwijl je aan een stang hangt."
  },
  {
    "name": "Landmine Press",
    "muscleGroup": "shoulders",
    "type": "compound",
    "description": "Een schouderoefening waarbij je een halter drukt die aan één uiteinde is verankerd in een landmine attachment."
  },
  {
    "name": "Landmine Row",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Een rugoefening waarbij je een halter trekt die aan één uiteinde is verankerd in een landmine attachment naar je torso."
  },
  {
    "name": "Donkey Calf Raise",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Een kuit oefening waarbij je je hielen optilt terwijl je voorover buigt met gewicht op je onderrug."
  },
  {
    "name": "Springtouw",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Een cardiovasculaire oefening waarbij je over een touw springt terwijl het onder je voeten en over je hoofd gaat."
  },
  {
    "name": "Hardlopen",
    "muscleGroup": "legs",
    "type": "cardio",
    "description": "Een cardiovasculaire oefening waarbij je jogt of sprint over een afstand."
  },
  {
    "name": "Fietsen",
    "muscleGroup": "legs",
    "type": "cardio",
    "description": "Een cardiovasculaire oefening waarbij je op een fiets rijdt, stationair of bewegend."
  },
  {
    "name": "Roeimachine",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Een cardiovasculaire oefening die de actie van roeien in een boot nabootst, met behulp van een machine."
  },
  {
    "name": "Elliptische Trainer",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Een cardiovasculaire oefening uitgevoerd op een machine die wandelen of rennen nabootst zonder overmatige druk op de gewrichten."
  },
  {
    "name": "High-Intensity Interval Training (HIIT)",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Een vorm van cardiovasculaire oefening die korte periodes van intensieve anaerobe oefening afwisselt met minder intense herstelperiodes."
  },
  {
    "name": "Stair Climber",
    "muscleGroup": "legs",
    "type": "cardio",
    "description": "Een cardiovasculaire oefening uitgevoerd op een machine die de beweging van traplopen nabootst."
  },
  {
    "name": "Aerobics",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Een vorm van cardiovasculaire oefening die ritmische activiteiten omvat, vaak uitgevoerd op muziek."
  },
  {
    "name": "Dance Cardio",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Een cardiovasculaire oefening die verschillende dansbewegingen en routines omvat om de hartslag te verhogen."
  },
  {
    "name": "Shadow Boxing",
    "muscleGroup": "full_body",
    "type": "cardio",
    "description": "Een cardiovasculaire oefening waarbij je stoten in de lucht maakt om de hartslag te verhogen en de cardiovasculaire fitheid te verbeteren."
  },
  {
    "name": "Lat Pulldown met Smalle Greep",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Een variatie van de lat pulldown waarbij je een smalle greep gebruikt om de binnenste rugspieren te richten."
  },
  {
    "name": "Lat Pulldown met Onderhandse Greep",
    "muscleGroup": "back",
    "type": "machine",
    "description": "Een variatie van de lat pulldown waarbij je een onderhandse greep gebruikt om de biceps en bovenrug te trainen."
  },
  {
    "name": "Kabel Pullover",
    "muscleGroup": "back",
    "type": "isolation",
    "description": "Een rugoefening waarbij je een kabelstang van boven je hoofd naar je heupen trekt, gericht op de lats."
  },
  {
    "name": "Halter Pullover",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Een veelzijdige oefening die de borst en lats traint door een halter boven je hoofd te laten zakken en op te tillen terwijl je op een bank ligt."
  },
  {
    "name": "Omgekeerde Bench Press",
    "muscleGroup": "chest",
    "type": "compound",
    "description": "Een variatie op de bench press waarbij je een omgekeerde greep gebruikt om de bovenste borst en triceps te benadrukken."
  },
  {
    "name": "Kabel Borstdruk",
    "muscleGroup": "chest",
    "type": "isolation",
    "description": "Een borstoefening waarbij je een kabelaccessoire naar voren drukt, vergelijkbaar met de bench press, maar met constante spanning."
  },
  {
    "name": "Kabel Voorwaartse Heffing",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Een schouderoefening waarbij je een kabelaccessoire naar voren heft, gericht op de voorste deltoïden."
  },
  {
    "name": "Kabel Zijwaartse Heffing",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Een schouderoefening waarbij je een kabelaccessoire zijwaarts heft, gericht op de laterale deltoïden."
  },
  {
    "name": "Eenzijdige Halter Roei",
    "muscleGroup": "back",
    "type": "compound",
    "description": "Een rugoefening waarbij je een halter naar je torso trekt terwijl je gebogen staat, gericht op elke kant afzonderlijk."
  },
  {
    "name": "Halter Schouderophalen",
    "muscleGroup": "shoulders",
    "type": "isolation",
    "description": "Een schouderoefening die de trapezius traint door de schouders op te halen terwijl je halters vasthoudt."
  },
  {
    "name": "Liggende Been Curl",
    "muscleGroup": "legs",
    "type": "machine",
    "description": "Een machine-oefening die de hamstrings traint door de benen richting de billen te krullen terwijl je op je buik ligt."
  },
  {
    "name": "Good Morning",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een onderlichaamsoefening waarbij je in de heup buigt om je torso te laten zakken, gericht op de hamstrings en billen."
  },
  {
    "name": "Zercher Squat",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een squat-variatie waarbij je de halter in de kromming van je ellebogen houdt, waarbij de quadriceps en de core worden benadrukt."
  },
  {
    "name": "Sissy Squat",
    "muscleGroup": "legs",
    "type": "isolation",
    "description": "Een quad-gecentreerde squat-variatie uitgevoerd met een sissy squat-bank of door achterover te leunen op de bal van je voeten."
  },
  {
    "name": "Jefferson Deadlift",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een deadlift-variatie waarbij je de halter omcirkelt, gericht op de quadriceps, billen en core."
  },
  {
    "name": "Cossack Squat",
    "muscleGroup": "legs",
    "type": "compound",
    "description": "Een onderlichaamsoefening waarbij je een diepe zijwaartse lunge maakt, gericht op de binnenste dijen en billen."
  },
  {
    "name": "Dragon Flag",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Een geavanceerde core-oefening waarbij je je lichaam in een rechte lijn laat zakken en optilt terwijl je op een bank ligt."
  },
  {
    "name": "Holle Lichaamshouding",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Een core-oefening waarbij je een holle positie aanneemt, met je onderrug tegen de vloer gedrukt en je armen en benen uitgestrekt."
  },
  {
    "name": "Omgekeerde Crunch",
    "muscleGroup": "abdomen",
    "type": "bodyweight",
    "description": "Een buikspieroefening waarbij je je heupen naar je borst buigt, gericht op de onderste buikspieren."
  },
  {
    "name": "Ab Wheel Rollout",
    "muscleGroup": "core",
    "type": "bodyweight",
    "description": "Een core-oefening waarbij je een ab wheel van je lichaam afrolt terwijl je je core stabiel houdt."
  },
  {
    "name": "Pike Push-Up",
    "muscleGroup": "shoulders",
    "type": "bodyweight",
    "description": "Een schouderoefening waarbij je een push-up uitvoert in een pike-positie, gericht op de schouders."
  },
  {
    "name": "Cable Crunch",
    "muscleGroup": "abdomen",
    "type": "bodyweight",
    "description": "Een buikspieroefening waarbij je een crunch-beweging maakt met een kabel voor extra weerstand."
  }
]
